DSCore.IO.FilePath.Extension(System.String)
Returns the extension from a file path.
path: Path to get extension of.

DSCore.IO.FilePath.DirectoryName(System.String)
Returns the directory name of a file path.
path: Path to get directory information of.
directorypath

DSCore.IO.FilePath.FileName(System.String,System.Boolean)
Returns the file name of a file path.
path: Path to get the file name of.
withExtension: Determines whether or not the extension is included in the result, defaults to true.