DSCore.DateTime.Format(System.DateTime,System.String)
Return a specified date and time as a string, in the specified format.
dateTime: The DateTime to format.
format: String representation of the date format.  Uses InvariantCulture, which outputs independent of the user's operating system language.
Defaults to standard format "F" : "Tuesday, 21 February 2017 23:02:43"
Search "MSDN Custom Date and Time Format Strings" for a comprehensive list of format specifiers.
The specified date and time as a string, in the specified format.

DSCore.DateTime.DayOfWeek(System.DateTime)
Returns the Day of the Week from a given DateTime.
dateTime: A DateTime object.
Day of the week