DSCore.Properties.Resources.ExportToCSVObsolete
Looks up a localized string similar to Use CSV.WriteToFile node instead.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Looks up a localized string similar to Number of items does not match the number of keys..