DSCore.List.ContainsItem(System.Collections.IList,System.Object)
Determines if the given list contains the given item.
list: List to search in.
item: Item to look for.
Whether list contains the given item.
item,search,in,listcontains

DSCore.List.Reverse(System.Collections.IList)
Creates a new list containing the items of the given list but in reverse order.
list: List to be reversed.
New list.
flip,listcontains

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Build sublists from a list using DesignScript range syntax.
list: The list from which to create sublists.
ranges:
The index ranges of the sublist elements.
Ex. \"{0..3,5,2}\"
offset:
The offset to apply to the sublist.
Ex. the range \"0..3\" with an offset of 2 will yield
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
Sublists of the given list.
sublists,build sublists,subset,

DSCore.List.Deconstruct(System.Collections.IList)
Given a list, produces the first item in the list, and a new list containing all items
except the first.
list: List to be split.
First item in the list.
Rest of the list.
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Sort list based on its keys
list: list to be sorted
keys: list of keys
sorted list
sorted keys
sort;key

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Adds an item to the beginning of a list.
item: Item to be added. Item could be an object or a list.
list: List to add on to.
New list.
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Adds an item to the end of a list.
item: Item to be added.Item could be an object or a list.
list: List to add on to.
insert,add,item,end

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
List elements along each diagonal in the matrix from the top left to the lower right.
list: A flat list
subLength: Length of each new sub-list.
Lists of elements along matrix diagonals.
diagonal,right,matrix,get diagonals,diagonal sublists