DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Returns the width and height of an image.
image: Image to get dimensions of.

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Write the image to a path, given the specified file name.
path:
image: The image to write
It is successful or not.
write image,image,file,filepath