DSCore.Color.Brightness(DSCore.Color)
Returns the brightness value for this color.
double between 0 and 1 inclusive.

DSCore.Color.Saturation(DSCore.Color)
Returns the saturation value for this color.
double between 0 and 1 inclusive.

DSCore.Color.Hue(DSCore.Color)
Returns the hue value for this color.
double between 0 and 1 inclusive.
hues