DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Removes characters from a string.
str: String to remove characters from.
startIndex: Index at which to start removal.
count:
Amount of characters to remove, by default will remove all characters from
the given startIndex to the end of the string.
Note: if the Count is negative, the removal process goes from right to left.
String with characters removed.
delete,rem,shorten