DSCore.Math.Random(System.Double,System.Double)
Produce a random number in the range [lower_number, higher_number).
value1: One end of the range for the random number.
value2: One end of the range for the random number.
Random number in the range [lowValue, highValue).
random,numberrange

DSCore.Math.Asin(System.Double)
Finds the inverse sine, the angle whose sine is the given ratio.
ratio: The sine of the angle, a number in the range [-1, 1].
The angle whose sine is the input ratio.
asine,arcsin

DSCore.Math.Floor(System.Double)
Returns the first integer smaller than the number.
number: Number to round up.
First integer smaller than the number.
round

DSCore.Math.Round(System.Double,System.Int32)
Rounds a number to a specified number of fractional digits.
number: Number to be rounded.
digits: Number of fractional digits in the return value.
The number nearest to value that contains a number of fractional digits equal to digits.