DSCore.IO.Directory.Contents(System.IO.DirectoryInfo,System.String)
Returns all of the contents of a given directory.
directory: Directory to get contents of.
searchString: Search string used to filter results. Defaults to "*.*" (displays all contents).

DSCore.IO.Directory.Exists(System.String)
Determines if a directory exists at the given path.
path: Path to a directory on disk.
directorypath