DSCore.IO.File.AbsolutePath(System.String,System.String)
Returns absolute path from the given path. If the given path is
relative path then it is resolved with respect to the current
workspace. If file doesn't exist at the relative path but exists
at the given hintPath then hintPath is returned.
path: Relative path or full path
hintPath: Last resolved path
Returns: Absolute path

DSCore.IO.File.FromPath(System.String)
Creates File object from given file path.
path:
Returns:

DSCore.IO.File.Exists(System.String)
Determines if a file exists at the given path.
path:
filepath

DSCore.IO.File.WriteText(System.String,System.String)
Write the text content to a file specified by the path
filePath: Path to write to
text: Text content
write file,text,file,filepath